In [1]:
# import
import pandas as pd
import numpy as np

import datetime 
from datetime import datetime, date

import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [3]:
pd.DataFrame(np.arange(1,6))

   0
0  1
1  2
2  3
3  4
4  5

In [8]:
df = pd.DataFrame(np.array([[10, 11], [20,21]]), columns=['missoula', 'philadelphia'])
df

   missoula  philadelphia
0        10            11
1        20            21

In [9]:
df.columns

Index(['missoula', 'philadelphia'], dtype='object')

In [10]:
len(df)

2

In [13]:
temps_missoula = [70,71]
temps_philly = [90,91]
temperatures = {'Missuola':temps_missoula, 'Philadelphia':temps_philly}
pd.DataFrame(temperatures)

   Missuola  Philadelphia
0        70            90
1        71            91

In [15]:
df = pd.DataFrame([temps_missoula, temps_philly])
df

    0   1
0  70  71
1  90  91

In [16]:
df.columns = ['Missoula', 'Philadelphia']
df

   Missoula  Philadelphia
0        70            71
1        90            91

In [17]:
temp_nyc_series = pd.Series([85,87], index=[1,2])
temp_nyc_series

1    85
2    87
dtype: int64

In [18]:
temp_mso_series = pd.Series(temps_missoula)
temp_phl_series = pd.Series(temps_philly)

In [19]:
temp_mso_series

0    70
1    71
dtype: int64

In [20]:
temp_phl_series

0    90
1    91
dtype: int64

In [21]:
df = pd.DataFrame({'Missoula':temp_mso_series, 'Philadelphia':temp_phl_series, 'New_York':temp_nyc_series})
df

   Missoula  Philadelphia  New_York
0      70.0          90.0       NaN
1      71.0          91.0      85.0
2       NaN           NaN      87.0

In [25]:
sp500 = pd.read_csv('./Learning-Pandas-Second-Edition-master\data/sp500.csv', index_col='Symbol', usecols=[0,2,3,7])
sp500.head()

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [32]:
print(len(sp500))
print(sp500.shape)
print(sp500.size)
print(sp500.columns)

500
(500, 3)
1500
Index(['Sector', 'Price', 'Book Value'], dtype='object')

In [34]:
sp500['Sector']

Symbol
MMM                Industrials
ABT                Health Care
ABBV               Health Care
ACN     Information Technology
ACE                 Financials
                 ...
YHOO    Information Technology
YUM     Consumer Discretionary
ZMH                Health Care
ZION                Financials
ZTS                Health Care
Name: Sector, Length: 500, dtype: object

In [35]:
sp500[['Price', 'Book Value']]

         Price  Book Value
Symbol
MMM     141.14      26.668
ABT      39.60      15.573
ABBV     53.95       2.954
ACN      79.79       8.326
ACE     102.91      86.897
...        ...         ...
YHOO     35.02      12.768
YUM      74.77       5.147
ZMH     101.84      37.181
ZION     28.43      30.191
ZTS      30.53       2.150

[500 rows x 2 columns]

In [36]:
sp500.Price

Symbol
MMM     141.14
ABT      39.60
ABBV     53.95
ACN      79.79
ACE     102.91
         ...
YHOO     35.02
YUM      74.77
ZMH     101.84
ZION     28.43
ZTS      30.53
Name: Price, Length: 500, dtype: float64

In [38]:
sp500.loc['MMM']

Sector        Industrials
Price              141.14
Book Value         26.668
Name: MMM, dtype: object

In [39]:
sp500.loc[['MMM', 'MSFT']]

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
MSFT    Information Technology   40.12      10.584

In [40]:
sp500.iloc[3]

Sector        Information Technology
Price                          79.79
Book Value                     8.326
Name: ACN, dtype: object

In [42]:
sp500.iloc[[2,4]]

             Sector   Price  Book Value
Symbol
ABBV    Health Care   53.95       2.954
ACE      Financials  102.91      86.897

In [43]:
sp500.index.get_loc('MMM')

0

In [44]:
sp500.iloc[sp500.index.get_loc('MMM')]

Sector        Industrials
Price              141.14
Book Value         26.668
Name: MMM, dtype: object

In [46]:
sp500.index.get_loc('ABBV')

2

In [49]:
sp500.loc['ABBV', 'Price']

53.95

In [51]:
sp500.at['ABBV', 'Price']

53.95

In [48]:
sp500.iloc[1,2]

15.573

In [52]:
sp500.iat[1,2]

15.573

In [55]:
sp500[:5]

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [60]:
sp500['ABT':'ACN']

                        Sector  Price  Book Value
Symbol
ABT                Health Care  39.60      15.573
ABBV               Health Care  53.95       2.954
ACN     Information Technology  79.79       8.326

In [62]:
sp500.iloc[:, 1:]

         Price  Book Value
Symbol
MMM     141.14      26.668
ABT      39.60      15.573
ABBV     53.95       2.954
ACN      79.79       8.326
ACE     102.91      86.897
...        ...         ...
YHOO     35.02      12.768
YUM      74.77       5.147
ZMH     101.84      37.181
ZION     28.43      30.191
ZTS      30.53       2.150

[500 rows x 2 columns]

In [66]:
sp500[sp500.Price<10]

                             Sector  Price  Book Value
Symbol
BEAM         Consumer Discretionary   0.00         NaN
FTR     Telecommunications Services   5.81       3.989
HCBK                     Financials   9.80       9.596
HBAN                     Financials   9.10       6.995
SLM                      Financials   8.82      11.895
WIN     Telecommunications Services   9.38       1.199

In [68]:
# Price가 6이상 10이하인 종목을 추출하기
sp500[(sp500.Price>=6)&(sp500.Price<=10)]

                             Sector  Price  Book Value
Symbol
HCBK                     Financials   9.80       9.596
HBAN                     Financials   9.10       6.995
SLM                      Financials   8.82      11.895
WIN     Telecommunications Services   9.38       1.199

In [74]:
#Sector가 health Care 가격이 100$이상인
sp500[(sp500.Price>=100)&(sp500.Sector=='Health Care')]

             Sector   Price  Book Value
Symbol
ACT     Health Care  213.77      55.188
ALXN    Health Care  162.30      13.628
AGN     Health Care  166.92      22.207
AMGN    Health Care  114.33      30.045
BCR     Health Care  146.62      26.964
BDX     Health Care  115.70      27.510
BIIB    Health Care  299.71      38.519
CELG    Health Care  150.13      11.200
HUM     Health Care  124.49      62.829
ISRG    Health Care  363.86      95.224
JNJ     Health Care  100.98      27.083
LH      Health Care  100.75      29.496
MCK     Health Care  183.75      36.892
PRGO    Health Care  138.63      63.962
REGN    Health Care  297.77      22.402
TMO     Health Care  115.74      51.212
WAT     Health Care  100.54      21.460
WLP     Health Care  108.82      86.358
ZMH     Health Care  101.84      37.181

In [75]:
# 종목 'ABT', 'ZTS'의 가격과 섹터값을 출력
sp500.loc[['ABT','ZTS'],['Price', 'Sector']]

        Price       Sector
Symbol
ABT     39.60  Health Care
ZTS     30.53  Health Care

In [76]:
sp500.loc[['ABC', 'ZTS']][['Sector', 'Price']]

             Sector  Price
Symbol
ABC     Health Care  71.64
ZTS     Health Care  30.53